tutorials/fluidSolidInteraction/dbns_explicitGodunov/perpendicularFlap/dbns-lineaGeoToal/constant/fluid/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType     externalStiffenedGasThermo ;//externalStiffenedGasThermo;



// stiffenedGasCoeffs
// {
//     gamma  2.35;
//     pInf 7.353800e+08;
//     Cv 1816;
//     q -1.167006e+06;
//     mu 1;
//     Pr 7;
// };
stiffenedGasCoeffs
{
    gamma  1.4;
    pInf 0;
    Cv 718;
    q  0;
    mu 1;
    Pr 0.72;
    pRef 1e5;
};

// thermoType      hPsiThermo<pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>;

// // name, nMoles, mol weight, CP, Hf, mu, Pr;
// mixture         air 1 28.9 717.5 0 1.8e-05 0.7;


// ************************************************************************* //
