tutorials/fluidSolidInteraction/dbns_explicitGodunov/perpendicularFlap/dbns-lineaGeoToal/system/functions
functions
{
    pointDisp
    {
       type    solidPointDisplacement;
       point   (2 1 0.1);
	   region  "solid";
    }
    forces
    {
        type                forces;
        region              fluid;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             (interface);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rho;
        log                 true;
        rhoInf              1;
        CofR                (0.5 0.1 0);
    }
}
